lepirlouit/badge_2024_micropython/ports/esp32/boards/FRI3D_BADGE_2022/mpconfigboard.h
#ifndef MICROPY_HW_BOARD_NAME
// Can be set by mpconfigboard.cmake.
#define MICROPY_HW_BOARD_NAME               "Fri3d Badge 2022"
#endif

#ifndef MICROPY_HW_MCU_NAME
#define MICROPY_HW_MCU_NAME                 "ESP32S3"
#endif
